#!/usr/bin/env python
# -*- coding: utf-8 -*-

__doc__ = '''gmbox常量文件

这个文件定义了gmbox核心库使用的常量，可能需要定时更新。
'''

ARTIST = {
          "华语":[
                ("华语男歌手", "cn/male"),
                ("华语女歌手", "cn/female"),
                ("华语乐队组合", "cn/group")
                ],
          "欧美":[
                ("欧美男歌手", "western/male"),
                ("欧美女歌手", "western/female"),
                ("欧美乐队组合", "western/group")],
          "日韩":[
                ("日韩男歌手", "jpkr/male"),
                ("日韩女歌手", "jpkr/female"),
                ("日韩乐队组合", "jpkr/group")],
          "其他":[
                ("其他歌手", "other")]
}

GENRES = [
    ("摇滚", 'style_rock'),
    ("民谣", 'style_folk'),
    ("流行", 'style_pop'),
    ("乡村", 'style_country'),
    ("嘻哈", 'style_hiphop'),
    ("爵士", 'style_jazz'),
    ("电子", 'style_elc'),
    ("节奏布鲁斯", 'style_blues')
]

CHARTLISTING_DIR = {"主打榜单": [
                             ("热歌榜 TOP500", "dayhot"),
                             ("新歌榜 TOP100", "new"),
                             ("歌手榜 TOP200", "artist")
                             ],
                    "分类榜单": [
                             ("中国好声音榜", "chinavoice2013"),
                             ("欧美金曲榜", "oumei"),
                             ("影视金曲榜", "yingshijinqu"),
                             ("情歌对唱榜", "lovesong"),
                             ("网络歌曲榜", "netsong"),
                             ("经典老歌榜", "oldsong"),
                             ("摇滚榜", "rock")
                             ],
                    "媒体榜单": [
                             ("KTV热歌榜", "ktv"), 
                             ("Billboard", "billboard"),
                             ("UK Chart", "ukchart"),
                             ("Hito中文榜", "hito"),
                             ("叱咤歌曲榜", "chizha")
                             ]
}

TAG_DIR = [
# 情绪
    "压抑", "平静", "快乐", "放松", "忧伤",
    "宣泄", "细腻", "发泄", "感动", "寂寞",
    "温暖", "失落", "忧郁", "思念", "悲伤",
    "失恋", "痛苦",
# 乐器
    "二胡", "琵琶", "口哨", "小提琴", "古筝",
    "钢琴", "民乐", "吉他",
# 节奏旋律
    "明快", "优美", "流畅", "婉转", "悠扬",
    "简单", "轻盈", "动感", "轻快", "舒缓",
# 场景
    "汽车", "夏天", "旅行", "阳光", "雨天",
    "春天", "冬天", "午后", "夜晚", "独自",
    "工作",
# 风格
    "中国风", "乡村", "儿歌", "前卫", "古典",
    "另类", "嘻哈", "宗教", "戏剧", "拉丁",
    "摇滚", "有声书", "民族", "民谣", "流行",
    "演讲", "灵歌", "爵士蓝调", "电子", "硬摇滚",
    "脱口秀", "舞曲", "节奏布鲁斯", "节庆音乐", "蓝调",
    "语言艺术", "说唱", "轻音乐", "迷幻", "金属",
    "革命歌曲", "音乐剧",
# 主题
    "情歌", "影视", "公益", "奥运", "励志",
    "广告", "游戏",
# 音色
    "高亢", "轻柔", "沧桑", "甜美", "聆听",
    "吟唱", "明亮", "清澈", "慵懒", "沙哑",
    "温柔", "空灵", "磁性", "粗犷", "低沉",
    "柔美"
]
